[{
  "_id": {
    "$oid": "671b3ae6c30d45f248c0f813"
  },
  "file_name": "pdf12.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf12.pdf",
  "file_size": 268943,
  "title": "S.C.R. SUPREME COURT REPORTS 107 THE GRAHAM TRADING CO. LTD.",
  "author": "INDIA, i, ii, iii, iv",
  "keywords": [
    "bonus",
    "payment",
    "puja",
    "case",
    "workmen",
    "made",
    "term",
    "implied",
    "month",
    "paid"
  ],
  "summary": "In determining whether the payment was\ncustomary and traditional the following circumstances have to be\nestablished :\n(i) that the payment has been made over an unbroken series\nof years; ,\n(ii) that it has been for a sufficiently long period, the\nperiod has to be longer than in the case of an implied term of\nemployment;\n(iii) that it has been paid even in years of loss and did not\ndepend on the earning of profits ; and\n(iv) that the payment has been made at a uniform rate\nthroughout.\n In such a case, the Tribunal will have to\nconsider: (i) whether the payment has been over an\nunbroken series of years; (ii) whether it has been for a\nsufficiently long period, though the length of the period\nmight depend on the circumstances of each case : even\nso the period may normally have to be longer to\njustify an inference of traditional and customary puja.\nbonus than may be the case with puja bonus based on\nan implied term of employment; (iii) the circumstance\nthat the payment depended upon the earning of profits\nwould have to be excluded and therefore it must be\nshown that payment was made in years of loss.",
  "time_taken_sec": 10.367233276367188,
  "memory_usage_mb": 814.54296875
},
{
  "_id": {
    "$oid": "671b3ae9c30d45f248c0f814"
  },
  "file_name": "pdf1.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf1.pdf",
  "file_size": 650025,
  "title": "1008 SUPREME COURT REPORTS [1950] 1950 of section 14, it",
  "author": "2, XI of 1922, 2, xv",
  "keywords": [
    "court",
    "company",
    "case",
    "income",
    "tax",
    "high",
    "facts",
    "tribunal",
    "1",
    "mills"
  ],
  "summary": "\"10. (1) \"The tax shall be payable by an assessee\no. under the head 'Profits and gains of business, pro\nKania J.\nfession or vocation' in respect of the profits or gains of\nany bminess, profession or vocation carried on by\nhim.\n(2) Such profits or gains shall be computed after\nmaking the following allowances, namely:-\n....................................\n(xv) any expenditure (not being in the nature\nof capital expenditure or personal expenses of the\nassessee) laid out or expended wholly and exclusively\nfor the purpose of such business, profession or voca\ntion. The first paragraph of the order of the Appellate\nAssistant Commissioner contains the following\n(ll [1927) I K, B. 719. 12) 6 I.T.C. '49,\n•\n•\n'\n•\nS.C.R. SUPREME COURT REPORTS l017\nstatement:-\" In disallowing this (interest) claim the\n1950\nIncome-tax Officer was following the decision of my .--\npredecessor in his order dated the 18th March 1942 in Oommimoner 0!\n",
  "time_taken_sec": 13.642248392105103,
  "memory_usage_mb": 940.3828125
},
{
  "_id": {
    "$oid": "671b3aeec30d45f248c0f815"
  },
  "file_name": "pdf11.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf11.pdf",
  "file_size": 551321,
  "title": "S.C.R. SUPREME COURT REPORTS 93 NARAYANDAS BHAGWANDAS :MADHAVDAS I959 v.",
  "author": "JAFAR IMAM and J. L. KAPUR, JJ., VII of r947, 3, 3, V of r898, 3, 3, b, 3",
  "keywords": [
    "magistrate",
    "appellant",
    "court",
    "1952",
    "district",
    "additional",
    "offence",
    "september",
    "cognizance",
    "act"
  ],
  "summary": "Narayandas\n\"Seen the complaint filed to day against the\nBhagwandas\naccused Narayandas Bhagwandas Madhavdas under Madhavdas\nsection 8(2) of the Foreign Exchange Regulation Act v.\nread with Section 23B thereof read with Section 19 of The State of\nWest Bengal\nthe Sea Customs Act and Notification No. ]'.E.R.A.\n105/51 dated the 27th February, 1951, as amended,\nImam].\nissued by the Reserve Bank of India under Section\n8(2) of the Foreign Exchange Regulation Act. The main submission on behalf of the appellant was\ndirected towards establishing that the entire proceed:\nings before the Additional District Magistrate and the\ntrying Magistrate were without jurisdiction as cogniz\nance of the offence had been taken on September 16,\n1952, in contravention of the provisions of s. 23(3) of\nthe ]foreign Exchange Regulation Act, there being on\nthat date no complaint in writing made by an officer\nauthorised in that behalf by the Central Government\nor the Reserve Bank of India by a general or a special\norder.",
  "time_taken_sec": 18.383147716522217,
  "memory_usage_mb": 1017.265625
},
{
  "_id": {
    "$oid": "671b3af4c30d45f248c0f816"
  },
  "file_name": "pdf14.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf14.pdf",
  "file_size": 393198,
  "title": "126 SUPREME COUR.T REPORTS JNANENDRA NATH GHOSE v. Moy 8,",
  "author": "1, SYED JAFER IMAM AND J. L. KAPUR, JJ., I of I872",
  "keywords": [
    "evidence",
    "approver",
    "appellant",
    "jury",
    "crime",
    "court",
    "case",
    "accused",
    "deceased",
    "corroboration"
  ],
  "summary": "There can, no doubt be\na legal conviction upon the uncorroborated evi\ndence of an accomplice and, as already stated,\nthe uncorroborated testimony of an accomplice is\nstrictly admissible and a conviction based on it alone\nis not illegal, yet you should remember, gentlemen,\nthat experience teaches us that an accomplice being\nalways an infamous person, he having thrown to the\nwolves his associates and friends in order to save his\nown skin and, though criminal, has purchased his\nliberty by betrayal, his evidence must be received\nwith very great caution and it is highly dangerous\nto act upon his evidence unless it is materially\ncorroborated. As to the second submission made by Mr. Umrigar\nit is to be remembered that in Baskerville's case the\nJ nanendra Nath Court of Criminal Appeal in England after discussing\nGhose\nvarious authorities on the subject came to the follow\nv.\ning conclusion :-\nThe Slate of\n\" We hold that evidence in corroboration must be\nWest Ben.gal\nindependent testimony which affects the accused by\nImam].",
  "time_taken_sec": 11.211599349975586,
  "memory_usage_mb": 1206.66796875
},
{
  "_id": {
    "$oid": "671b3af8c30d45f248c0f817"
  },
  "file_name": "pdf13.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf13.pdf",
  "file_size": 471370,
  "title": "114 SUPREME COURT REPORTS r959 THE COM:HISSIOXJ<JR OF INCOME-TAX, BOMBAY",
  "author": "1, XI of r922, 1, 1, r, b, J, 1, 'r s. 34(r, 1, 3, 1, , 1948",
  "keywords": [
    "return",
    "income",
    "1",
    "notice",
    "tax",
    "assessment",
    "r",
    "34",
    "bombay",
    "year"
  ],
  "summary": "Karsondas, Bombay\nSectic;:m 34(1), omitting parts not relevant, reads:- Hidayatullali J.\n\"(l) If ...\n(a) the Income-tax Officer has reason to believe\nthat.by reason of the omission or failure· on the part\nof an assessee to make a return of his income under\nsection 22, for any year ...... , or\n(b) notwithstimrling that there has been no omis\nsion or failure as mentioned in clause (a) on the part\nof the assessee, the Income-tax Officer has in con\nsequence of information in his possession reason to\nbelieve that income, profits or gains chargeable to\nincome-tax have escaped assessment for any year ...\n less than sixty days ... a return .. ., setting forth ... his\ntotal income and tot.ti world income during that\nyear:\n•\n* *\n(2) In the case of any person whose total income\nis, in the Income-tax Officer's opinion, of such an\namount as to render such person liable to income\ntax, the Income-tax Officer may serve a notice upon\nhim requiring him to furnish, within such period,\nnot being less than thirty days ... a return ... setting\nforth . . .",
  "time_taken_sec": 17.599295377731323,
  "memory_usage_mb": 1444.84375
},
{
  "_id": {
    "$oid": "671b3b03c30d45f248c0f818"
  },
  "file_name": "pdf15.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf15.pdf",
  "file_size": 502052,
  "title": "S.C.R. SUPREME COURT REPORTS 137 SHRI B. P. HIRA, WORKS",
  "author": "LXIII of z948, l, Bom. 79 of z948, 4 of 1936, 1, LXIII of 1948, 1, Born. 79 of 1948, 1, 1",
  "keywords": [
    "act",
    "factories",
    "wages",
    "2",
    "said",
    "overtime",
    "factory",
    "1",
    "70",
    "authority"
  ],
  "summary": "Nows. 2(m) of the Factories Act defines a factory as\nmeaning any premises including the precincts thereof-\n\" (i) whereon ten or more workers are working,\nor were working on any day of the preceding\ntwelve months, and in any part of which a\nmanufacturing process is being carried on with the\naid of power, or is ordinarily so carried on, or\n(ii) whereon twenty or more workers are working,\nor were working on aiiy day of the preceding twelve\nmonths, and in any part of which a manufacturing\nprocess is being carried on without the aid of power,\nor is ordinarily so carried on,-\nbut does not include a mine subject to the opera\ntion of the Mines Act, 1952 (XXXV of 1952), or a\nrailway running shed;\"\nands. A worker under s. 2(1) means a\nperson employed directly or through any agency,\nwhether for wages or not, in any manufacturing pro\ncess, or in cleaning any part of the machinery or\npremises used for manufacturing process, or in any\nother kind of work incidental to, or connected with,\nthe manufacturing process, or the subject of the\nmanufacturing process; and the manufacturing pro\ncess under s. 2(k) means any process for inter alia (1)\nmaking, altering, repairing, ornamenting, finishing,\npacking, oiling, washing, cleaning, breaking-up,\ndemolishing or otherwise treating or adapting any\narticle or substance with a view to its use, sale,\ntransport, delivery or disposal.",
  "time_taken_sec": 21.407103300094604,
  "memory_usage_mb": 1350.7578125
},
{
  "_id": {
    "$oid": "671b3b22c30d45f248c0f819"
  },
  "file_name": "pdf18.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf18.pdf",
  "file_size": 13767577,
  "title": "THE PREVENTION OF MONEY-LAUNDERING OF RECORDS) RULES, 20051 In exercise",
  "author": "MAINTENANCE OF RECORDS, 1, h, i, j, k, 2, 15 of 2003, l, Maintenance of Records, 2, l, a, 15 of 2003, aa, ha, aaa, a, aab, c, aac, v, E, i, E, w.e.f.24-6-2011, E, w.e.f.7-7-2015, E, w.e.f.1-6-2017",
  "keywords": [
    "e",
    "shall",
    "rule",
    "f",
    "r",
    "dated",
    "client",
    "1",
    "reporting",
    "account"
  ],
  "summary": "from previous page\nproduction of a self-attested photograph and affixation of signature or thumb print, as\nthecase may be, on the form for opening the account:\nProvided that-\n(i) the designated officer of the banking company, while opening the small account,\ncertifies under his signature that the person opening the account has affixed his\nsignature or thumb print, asthe case may be, in his presence;\n(ii) a small account shall be opened only at Core Banking Solution linked banking\ncompany branches orinabranch where itispossible tomanually monitor and ensure\nthat foreign remittances are not credited to a small account and that the stipulated\nlimits onmonthly and annual aggregate oftransactions and balance insuch accounts\nare not breached, before a transaction isallowed to take place;\n(iii) asmall account shall remain operational initially foraperiod oftwelve months, and\nthereafter for a further period of twelve months if the holder of such an account\nprovides evidence before the banking company of having applied for any of the\nofficiallyvalid documents within twelve months ofthe opening ofthe said account,\nwith the entire relaxation provisions to be reviewed in respect of the said account\nafter twenty-four months;\n(iv) asmall account shallbemonitored and when there issuspicion ofmoney laundering\nor financing of terrorism or other high risk scenarios, the identity of client shall be\nestablished through the production of officiallyvalid documents, as referred to in\nsub-rule (2)ofrule 9;and\n(v) foreign remittance shall not be allowed to be credited into a small account unless\ntheidentity oftheclientisfully established through theproduction ofofficiallyvalid\ndocuments, asreferred to in sub-rule (2)ofrule 9,\n(3)Where theclientisacompany, itshall forthepurposes ofsub-rule (1)submit tothe\nbanking company orfinancialinstitution orintermediary, asthe casemay be,onecertified\ncopy ofthe following documents-c-\n(i) Certificate ofincorporation;\n(ii) Memorandum and Articles ofAssociation;\n(iii) a resolution from the Board of Directors and power of attorney granted, to its\nmanagers, officersor employees to transact on its behalf; and\n(iv) an officiallyvalid document in respect of managers, officers or employees holding\nan attorney to transact on itsbehalf,\n(4)Where theclientisapartnership firm,itshallforthepurposes ofsub-rule (1)submit\ntothebanking company, orthefinancialinstitution, ortheintermediary onecertifiedcopy\nofthe following documents:-\n(i) registration certificate;\n(ii) partnership deed; and\n(iii) an officiallyvalid document in respect ofthe person holding an attorney to transact\non itsbehalf,\n(5)Where the client is a trust, it shall, \"for the purposes ofsub-rule (1)submit to the\nbanking company,\" or the financial institution, or the intermediary one certified copy of\nthe following documents:-\n(i) registration certificate;\n(ii) trust deed; and\n(iii) an officiallyvalid document in respect oftheperson holding an attorney to transact\non itsbehalf,\nConid. [Rule 3\nRules, 2005\nl[(BA) alltransactionsinvolvingreceiptsbynon-profitorganisationsofvalue\nmore than rupees ten lakh, or its equivalent in foreign currency;]\n2[(C) all 'cash transactions where forged or counterfeit currency notes\nor bank notes have been used as genuine or where any forgery of\na valuable security or a document has taken place facilitating the\ntransactions;]\n(D) all suspicious transactions whether or not made in cash and by way\nof-\n(i) deposits and credits, withdrawals into or from any accounts in\nwhatsoever name theyarereferred toinanycurrencymaintained\nby way of-\n(a) cheques including third party cheques, pay orders, demand\ndrafts,cashierschequesoranyotherinstrument ofpayment of\nmoney including electronicreceipts or credits and electronic\npayments or debits, or\n(b) travellers cheques, or\n(c) transferfromoneaccountwithin the samebanking company,\nfinancial institution and intermediary, as the case may be,\nincluding from or to Nostro and Vostro accounts, or\n(d) any other mode in whatsoever name it is referred to;\n(ii) credits or debits into or from any non-monetary accounts.such\nas d-mat account, security account in any currency maintained\nby the banking company, financialinstitution and intermediary,\nas the case may be;\n(iii) money transfer or remittances in favour of own clients or\nnon-clientsfrom India or abroad and to third party beneficiaries\nin India or abroad including transactions on its own account in\nany currency by any of the following:-\n(a) payment orders, or\n(b) cashiers cheques, or\n(c) demand drafts, or\n(d) telegraphic or wire transfers or electronic remittances or\ntransfers, or\n(e) internet transfers, or\n(f) Automated Clearing House remittances, or\n(g) lockbox driven transfers or remittances, or\n(h) remittances for credit or loading to electroniccards, or\n1.",
  "time_taken_sec": 31.151639938354492,
  "memory_usage_mb": 2235.37890625
},
{
  "_id": {
    "$oid": "671b3b2cc30d45f248c0f81a"
  },
  "file_name": "pdf10.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf10.pdf",
  "file_size": 2126778,
  "title": "S.C.R. SUPREME COURT REPORTS 39 before the Tribunal was to",
  "author": "and connected petition, 30 of I958, IO of I955, Control",
  "keywords": [
    "sugar",
    "act",
    "export",
    "1",
    "government",
    "c",
    "v",
    "another",
    "loss",
    "l"
  ],
  "summary": "If two or\nmore Acts were parts of the same scheme or plan, to\nimplement the same or common objective, or if the\nimpugned Act, though it was not originally conceived\nat the time when the earlier Act was passed, was only\nan extension or a further step by legislature for\nimplementing the object of the earlier Act or if the\nlegislature by express reference incorporated in the\nimpugned Act the provisions of the earlier Act, it\nwould be permissible to rely upon the said provisions\nof the earlier Act, not because they formed part of the\nprevailing ·conditions but because either the earlier\nAct formed part of the impugned Act by reference or\nboth of them formed part of the same legislative plan.\n In evaluating such elusive\nfactors and forming their own conception of what is\nreasonable, in all the circumstances of a given case,\nit is inevitable that the social philosophy and the\nscale of values of the judges participating in the deci\nsion should play an important part, and the limit to\ntheir interference with legislative judgment in such\ncases can only be dictated by their sense of respon\nsibility and self-restraint and the sobering reflection\nthat the Constitution is meant not only for people of\ntheir way of thinking but for all, and that the major\nity of the elected representatives of the people have,\nin authorising the imposition of the restrictions, con\nsidered them to be reasonable.",
  "time_taken_sec": 80.86288189888,
  "memory_usage_mb": 2405.37109375
},
{
  "_id": {
    "$oid": "671b3b33c30d45f248c0f81b"
  },
  "file_name": "pdf16.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf16.pdf",
  "file_size": 234382,
  "title": "SECURITIES AND EXCHANGE BOARD OF INDIA DIRECTIONS UNDER SECTION AND",
  "author": "4, “CSE”",
  "keywords": [
    "01",
    "00",
    "12",
    "15",
    "35",
    "10000",
    "02",
    "sell",
    "buy",
    "0"
  ],
  "summary": "Time Broker Code Buy/Sale Quantity Price\n03-01-01 3:21:53 PM D0035 B 10000 335.00\n03-01-01 3:22:09 PM D0545 S 10000 335.00\n03-01-01 3:22:11 PM D0035 B 10000 335.00\n03-01-01 3:22:16 PM D0035 B 10000 335.00\n03-01-01 3:22:17 PM D0545 S 10000 335.00\n03-01-01 3:22:26 PM D0035 B 10000 335.00\n03-01-01 3:22:26 PM D0545 S 10000 335.00\n03-01-01 3:22:32 PM D0035 B 10000 335.00\n03-01-01 3:22:34 PM D0545 S 10000 335.00\n03-01-01 3:22:37 PM D0035 B 10000 335.00\n03-01-01 3:22:41 PM D0545 S 10000 335.00\nPage 25 of 41\n03-01-01 3:22:42 PM D0035 B 10000 335.00\n03-01-01 3:22:51 PM D0035 B 10000 335.00\n03-01-01 3:22:56 PM D0545 S 10000 335.00\n03-01-01 3:23:00 PM D0035 B 10000 335.00\n03-01-01 3:23:03 PM D0545 S 10000 335.00\n03-01-01 3:23:34 PM D0545 S 10000 335.00\n03-01-01 3:23:55 PM D0545 S 10000 335.00\n03-01-01 3:42:28 PM D0035 B 10000 335.00\n03-01-01 3:42:34 PM D0035 B 10000 335.00\n03-01-01 3:42:38 PM D0035 B 10000 335.00\n03-01-01 3:42:43 PM D0035 B 10000 335.00\n03-01-01 3:42:49 PM D0035 B 10000 335.00\n03-01-01 3:42:54 PM D0035 B 10000 335.00\n03-01-01 3:43:02 PM D0035 B 10000 335.00\n03-01-01 3:43:04 PM D0545 S 10000 335.00\n03-01-01 3:43:07 PM D0035 B 10000 335.00\n03-01-01 3:43:12 PM D0035 B 10000 335.00\n03-01-01 3:43:13 PM D0545 S 10000 335.00\n03-01-01 3:43:22 PM D0035 B 10000 335.00\n03-01-01 3:43:22 PM D0545 S 10000 335.00\n03-01-01 3:43:29 PM D0545 S 10000 335.00\n03-01-01 3:43:37 PM D0545 S 10000 335.00\n03-01-01 3:43:41 PM D0035 B 10000 335.00\n03-01-01 3:43:45 PM D0545 S 10000 335.00\n03-01-01 3:43:46 PM D0035 B 10000 335.00\n03-01-01 3:43:52 PM D0545 S 10000 335.00\n03-01-01 3:43:54 PM D0035 B 10000 335.00\n03-01-01 3:44:00 PM D0545 S 10000 335.00\n03-01-01 3:44:02 PM D0035 B 10000 335.00\n03-01-01 3:44:06 PM D0035 B 10000 335.00\n03-01-01 3:44:07 PM D0545 S 10000 335.00\n03-01-01 3:44:16 PM D0545 S 10000 335.00\n03-01-01 3:44:23 PM D0545 S 10000 335.00\n03-01-01 3:44:30 PM D0545 S 10000 335.00\n03-01-01 3:44:37 PM D0545 S 10000 335.00\n03-01-01 3:44:43 PM D0545 S 10000 335.00\n03-01-01 3:44:50 PM D0545 S 10000 335.00\nFrom the above, it can be seen that all orders both buy as well as sell\nwere placed in multiples of 10,000 and apart from these orders there were\nno other buy as well as sale orders prevalent at that time and time lag\nbetween buy and sale order in most of the occasions was very less and it\nPage 26 of 41\ncan be concluded that these were synchronized transactions with prior\nunderstanding to match.\n 84 31320534 15:23:52 0:01:44 sell 545 hulda 10000 335.00\n27-02-01 15:24:00 85 61178233 15:22:15 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:24:00 85 31320535 15:23:59 0:01:44 sell 545 hulda 10000 335.00\n27-02-01 15:24:07 86 61178234 15:22:27 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:24:07 86 31320537 15:24:06 0:01:39 sell 545 hulda 10000 335.00\n27-02-01 15:24:14 87 61178240 15:22:32 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:24:14 87 31320540 15:24:13 0:01:41 sell 545 hulda 10000 335.00\n27-02-01 15:24:20 88 61178242 15:22:36 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:24:20 88 31320543 15:24:20 0:01:44 sell 545 hulda 10000 335.00\n27-02-01 15:24:33 89 61178243 15:22:41 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:24:33 89 31320547 15:24:32 0:01:51 sell 545 hulda 10000 335.00\n27-02-01 15:24:39 90 61178245 15:22:49 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:24:39 90 31320549 15:24:39 0:01:50 sell 545 hulda 10000 335.00\n27-02-01 15:24:46 91 61178249 15:22:57 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:24:46 91 31320551 15:24:46 0:01:49 sell 545 hulda 10000 335.00\n27-02-01 15:24:53 92 61178272 15:23:53 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:24:53 92 31320554 15:24:52 0:00:59 sell 545 hulda 10000 335.00\n27-02-01 15:25:01 93 61178276 15:24:01 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:25:01 93 31320558 15:25:01 0:01:00 sell 545 hulda 10000 335.00\n27-02-01 15:25:08 94 61178282 15:24:09 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:25:08 94 31320562 15:25:08 0:00:59 sell 545 hulda 10000 335.00\n27-02-01 15:25:17 95 61178284 15:24:15 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:25:17 95 31320566 15:25:17 0:01:02 sell 545 hulda 10000 335.00\n27-02-01 15:25:25 96 61178310 15:25:25 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:25:25 96 31320569 15:25:24 0:00:01 sell 545 hulda 10000 335.00\n27-02-01 15:25:35 97 61178316 15:25:33 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:25:35 97 31320576 15:25:34 0:00:01 sell 545 hulda 10000 335.00\n27-02-01 15:25:47 98 61178324 15:25:37 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:25:47 98 31320585 15:25:47 0:00:10 sell 545 hulda 10000 335.00\n27-02-01 15:25:55 99 61178326 15:25:42 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:25:55 99 31320588 15:25:55 0:00:13 sell 545 hulda 10000 335.00\n27-02-01 15:26:05 100 61178328 15:25:54 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:26:05 100 31320591 15:26:05 0:00:11 sell 545 hulda 10000 335.00\n27-02-01 15:26:14 101 61178330 15:25:59 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:26:14 101 31320595 15:26:14 0:00:15 sell 545 hulda 10000 335.00\n27-02-01 15:26:26 102 61178340 15:26:22 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:26:26 102 31320600 15:26:26 0:00:04 sell 545 hulda 10000 335.00\n27-02-01 15:27:02 103 61178362 15:27:01 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:27:02 103 31320603 15:26:38 0:00:23 sell 545 hulda 10000 335.00\n27-02-01 15:27:07 104 61178367 15:27:07 **** buy 35 rathyatrasa 10000 335.00\n27-02-01 15:27:07 104 31320611 15:26:58 0:00:09 sell 545 hulda 10000 335.00\n27-02-01 15:27:31 105 61178378 15:27:31 **** buy 35 rathyatrasa 5000 335.00\n27-02-01 15:27:31 105 31320620 15:27:15 0:00:16 sell 545 Hulda 5000 335.00\nTotal 2080000\nNote : 545 – Biyani Securities Private Ltd\n35 – Harish Biyani\nPage 21 of 41\nFrom the above, it is noted that the buy as well as the sell orders were\nplaced in lots of 10,000 shares for the entire quantity (except for lot of\n5000 shares on few occasions).",
  "time_taken_sec": 62.60151505470276,
  "memory_usage_mb": 2301.9453125
},
{
  "_id": {
    "$oid": "671b3b7dc30d45f248c0f81c"
  },
  "file_name": "pdf17.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf17.pdf",
  "file_size": 2232079,
  "title": "CIRCULAR ORDERS OF THE HIGH COURT OF JUDICATURE AT ALLAHABAD",
  "author": "SUPPLEMENT, FROM 1 APRIL, 2011 TO SEPTEMBER, 2016",
  "keywords": [
    "court",
    "c",
    "hon",
    "ble",
    "cases",
    "l",
    "dated",
    "judicial",
    "ii",
    "g"
  ],
  "summary": "DIVISION OF U.P. IN ZONES COMPRISING DISTRICTS AS\nFORMULATED BY ADMINISTRATIVE COMMITTEE\n(i) KANPUR ZONE Kanpur Nagar, Ramabai Nagar (Kanpur Dehat),\nJhansi, Lalitpur, Hamirpur, Jalaun at Orai, Banda,\nFatehpur, Mahoba, Unnao and Chitrkoot.\n(ii) GORAKHPUR ZONE Gorakhpur, Deoria, Basti, Maharajganj,\nSiddharthnagar, Faizabad, Sultanpur, Pratapgarh,\nKushi Nagar at Padrauna, Ambedkarnagar at\nAkbarpur, Sant Kabir Nagar and CSM Nagar.\n(iii) BAREILLY ZONE Bareilly, Pilibhit, Rampur, Budaun, Bijnor,\nShahjahanpur, Moradabad, Jyotiba Phule Nagar\nand Sambhal.\n(iv) AGRA ZONE Agra, Aligarh, Mathura, Farrukhabad, Etah,\nEtawah, Mainpuri, Firozabad, Hathras, Kannauj,\nAuraiya and Kasganj.\n(v) LUCKNOW ZONE Lucknow, Hardoi, Raebareili, Gonda, Sitapur,\nBahraich, Barabanki, Lakhimpur Kheri, Shrawasti\nat Bhinga and Balrampur.\n (iv) Agra Zone Agra, Aligarh, Mathura, Farrukhabad, Etah, Etawah,\nMainpuri, Firozabad, Hathras, Kannauj, Auraiya and Kanshi\nRam Nagar\n(v) Lucknow Lucknow, Hardoi, Raebareli, Gonda, Sitapur, Bahraich,\nZone Barabanki, Lakhimpur Kheri, Shrawasti at Bhinga and\nBalrampur.\n(vi) Allahabad Allahabad, Varanasi, Mirzapur, Sonhadra, Ghazipur, Ballia,\nZone Mau, Azamgarh, Jaunpur, Bhadohi at Gyanpur, Chandauli\nand Kaushambi\n(vii) Meerut Zone Meerut, Muzaffarnagar, Saharanpur, Ghaziabad,\nBulandshahar, Baghpat, Gautam Budh Nagar, Hapur and\nShamli.\n9\nGuidelines for Transfer of Judicial Officers other than District Judges\n(I) Judicial officers will be due for transfer on completion of 3 years stay at\nheadquarter including, Additional Chief Judicial Magistrate (Railways), 2\nyears stay in an outlying courts, or at Sonbhadra.\n",
  "time_taken_sec": 133.12241983413696,
  "memory_usage_mb": 3975.15234375
},
{
  "_id": {
    "$oid": "671b3b82c30d45f248c0f81d"
  },
  "file_name": "pdf5.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf5.pdf",
  "file_size": 335126,
  "title": "�ेस �काशनी PRESS RELEASE भारतीय �रज़व र् बक� RESERVE BANK",
  "author": "RBI, ED, First Appellate Authority, Puneet Pancholy",
  "keywords": [
    "smt",
    "kar",
    "rbi",
    "र",
    "reserve",
    "bank",
    "department",
    "management",
    "क",
    "य"
  ],
  "summary": "�ेस �काशनी PRESS RELEASE\nभारतीय �रज़व र् बक�\nRESERVE BANK OF INDIA\nवेबसाइट : www.rbi.org.in/hindi सचं ार िवभाग, क��ीय कायार्लय, शहीद भगत �संह माग,र् फोटर्, मबुं ई - 400 001\nWebsite : www.rbi.org.in Department of Communication, Central Office, Shahid Bhagat Singh Marg, Fort,\nई-मले /email : helpdoc@rbi.org.in Mumbai - 400 001 फोन/Phone: 022 - 2266 0502\nJuly 01, 2024\nRBI appoints Smt. She has represented the Reserve\nBank in several Working Groups of BIS and has served as a member of other internal and\nexternal Committees.\n",
  "time_taken_sec": 4.850109577178955,
  "memory_usage_mb": 3249.765625
},
{
  "_id": {
    "$oid": "671b3b9cc30d45f248c0f81e"
  },
  "file_name": "pdf6.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf6.pdf",
  "file_size": 468975,
  "title": "THE SUPREME COURT REPORTS THE TATA OIL MILLS CO. LTD.",
  "author": "i, ii, iii, iv",
  "keywords": [
    "income",
    "company",
    "profits",
    "labour",
    "workmen",
    "profit",
    "capital",
    "year",
    "bonus",
    "rs"
  ],
  "summary": "In resisting the workmen's claim for bonus for the year\n1955-56 the appellant contended that in calculating gross profits\nfor the purpose of the Full Bench formula the following items of\nincome should be excluded :-\n(i) Income earned by way of rent, light and power ;\n(ii) estate revenue derived from sale of excess coconuts used\nin preparing oil grown in the appellant's groves;\n(iii) profit from sale of empty barrels ; and\n(iv) sale proceeds of tin cans, scraps, Jogs, planks, gunnies\netc.\nas they were extraneous income unrelated to the efforts of the\nworkmen.\n There is no\ndoubt that there must be contribution of the workmen\nin earning profits before they are entitled to profit\nbonus; but it wa.s not laid down in the Muir Mills\n\\\nCase(') that direct connection between the efforts of the\nworkmen and the particular item of profit earned must\nbe established before the profit can be taken into\naccount for the purposes of arriving at the available\n(1) 1955 (1) S.C.R. 991.\n",
  "time_taken_sec": 26.328113794326782,
  "memory_usage_mb": 4152.79296875
},
{
  "_id": {
    "$oid": "671b3badc30d45f248c0f81f"
  },
  "file_name": "pdf7.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf7.pdf",
  "file_size": 468890,
  "title": "S.C.R. SUPREME COURT REPORTS 13 beyond what has already been",
  "author": "Appellate Tribunal, 48 of z950, I of z956, Appellate Tribunal",
  "keywords": [
    "appeal",
    "company",
    "tribunal",
    "auction",
    "court",
    "purchaser",
    "act",
    "1",
    "employees",
    "industrial"
  ],
  "summary": "On July 24,\nthe Official Liquidators put the appellant No. 2, the\nauction-purchaser, in possession of the busi!'1e~s of the\nCompany, which is now being carried on by the second\nappellant as the sole proprietor.\n, As a result of the termination of the services of the\none hundred and forty two employees of the Company,\nas aforesaid, an industrial dispute was raised at the\ninstance of the said employePs whose list is attached\nto the order of Reference, dated August 26, 1954,\nwhich is in these terms:-\n\"Whereas an Industrial dispute exists between (1)\nMessrs. Great Inciian l\\Iotor Works Ltd., 33, Rowland\nRoad, Calcutta, represented by their Managing\nDirectors Sri C. D. Nundy and Sri K. D. Nundy, (2)\nOfficial Liquidators of the Company, Sri D. L. Dutta\n•\nand Sri C. D. Nundy, 33, Rowland Road, Calcutta\nand (3) Sri K. D. Nundy, Auction Purchaser of the\nCompany, 33, Rowland Road, Calcutta, and their 142,\nemployees, given in the enclosed list, represented by\nS.C.R. SUPREME COURT REPORTS 17\nthe Bus Workers' Union, 249, Bowbazar Street, r959\nCalcutta, regarding t,he matters specified in the G .\n It is a little difficult to appreciate why the auction\n•\npurchaser, having succeeded in obtaining the order, set\nout above, in his favour, changed his mind and prefer\nred an appeal which, in the events that had happened,\nwas not maintainable.\n''\\.\n24 SUPREME COURT REPORTS (1960(1)] \\\n1959 In our opinion, therefore, the Labour Appellate\nTribunal was not in error in dismissing the appeal by -1111\nGreat Indian\nthe Company and by the auction-purchaser, as in\nMotor Works Ltd.,\ncompetent.",
  "time_taken_sec": 16.62117075920105,
  "memory_usage_mb": 4394.7890625
},
{
  "_id": {
    "$oid": "671b3bbac30d45f248c0f820"
  },
  "file_name": "pdf8.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf8.pdf",
  "file_size": 298845,
  "title": "''\\. 24 SUPREME COURT REPORTS \\ 1959 In our opinion,",
  "author": "1960(1",
  "keywords": [
    "ltd",
    "ispahani",
    "bonus",
    "company",
    "workmen",
    "tribunal",
    "puja",
    "implied",
    "messrs",
    "appellate"
  ],
  "summary": "As to the benefits arising out of the\nservice rendered by the workmen under Messrs. M. M.\nIspahani Ltd., it held that there was termination of\nemployment of the workmen when Messrs. M. M.\nIspahani migrated to Pakistan and the employment of\nthe workmen by the company was fresh employment\nand they therefore were not entitled to any benefits\narising out of their employment under Messrs. M. M.\nIspahani Ltd. In\nthe present case, sin<:e the appellant has paid the bonus\nS.C.R. SUPREME COURT REPORTS 31\ncontinuously since its birth, we agree with the Appel I959\nlate Tribunal that the circumstances justify the\ninference of an implied term of employment for pay I spahani Ltd.\nCalcutta\nment of puja bonus at the rate of one month's wages\nv.\nevery year.",
  "time_taken_sec": 12.887695789337158,
  "memory_usage_mb": 5298.7265625
},
{
  "_id": {
    "$oid": "671b3bc3c30d45f248c0f821"
  },
  "file_name": "pdf9.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf9.pdf",
  "file_size": 310088,
  "title": "32 SUPREME COUI~T REPORTS PHULBARI TEA ESTATE I959 v. May6.",
  "author": "1, I4 of r947",
  "keywords": [
    "tribunal",
    "das",
    "enquiry",
    "court",
    "case",
    "act",
    "company",
    "evidence",
    "march",
    "witnesses"
  ],
  "summary": "This Court, speaking through\nVenkatarama Ayyar J. observed as follows in that\nconnection at p. 507 :-\n\" Stating it broadly and without intending it to\nbe exhaustive, it mav be observed that rules of natu\nral justice require th.~t a party should have the oppor\ntunity •>f a<ldueing all relevant evidence on which he\nrelies, that the evidence of the opponent should bC'\ntaken in his presence, and tha.t he should be given the\nopportunity of cro::;s,examining the witnesses exa.min\ned by that party, and that no materials should be\nrelied on agairnit him without his being given an\nopportunity of explaining them. In Messrs. Basa Musa\nSugar Works (Private) Ltd. v. Shobrati Khan (1 we had\n),\noccasion to point out that even where the employer\ndid not hold an enquiry before applying under s. 33 of\nthe Act for permission to dismiss an employee, he\ncould make good the defect by producing all relevant\nevidence which would hare been examined at the -\nenquiry, before the tribunal, in which case the tribunal\nwould consider the evidence and decide whether per\nmission should be granted or not.",
  "time_taken_sec": 9.362076759338379,
  "memory_usage_mb": 5811.328125
},
{
  "_id": {
    "$oid": "671b3bc4c30d45f248c0f822"
  },
  "file_name": "pdf2.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf2.pdf",
  "file_size": 5323822,
  "title": "S.C.R. SUPREME COURT REPORTS 889 the learned English Judges in",
  "author": "CASES Nos. 305 TO 348 OF 1951 AND PETITION No. 612 OF 1951, XXX of 1950, First Amendment",
  "keywords": [
    "state",
    "compensation",
    "act",
    "31",
    "entry",
    "article",
    "public",
    "law",
    "acquisition",
    "power"
  ],
  "summary": "The provisions of any existing law other than\na law to which the provisions of clause (6) apply, or\n(b) the provisions of any law which the State\nmay hereafter make-\n(i) for the purpose of imposing or levying any tax\nor penalty, or\n(ii) for the promotion of public health or the pre-\nvention of danger to life or property, or\n(iii) in pursuance of any agreement entered into\nbetween the Government of the Dominion of India or\nthe Government of India and the Government of any\nother country, or otherwise, with respect to property\ndeclared by law to be evacuee property ....... ,\n31-A. Saving of laws providing for acquisition of\nestates, etc.-(1) Notwithstanding anything in the\nforegoing provision;; of this Part no law providing for\nthe acquisition by the State of any e.state or of any\nrights therein or for the extinguishment or modifica-\ntion of any such rights, shall be deemed to be void on\nthe ground that it is inconsistent with, or takes away\nor abridges any of the rights conferred by any provi-\nsions of this Part : .....•\n'\n31-B. Validation of certain Acts and Regulations.\n The fact is that the law-making power of both Parlia-\nment and State Legislatures can be exercised only\n• subject to the aforesaid two restrictions, not by reason\nof anything contained in the entries themselves, but\nby reason of the positive provisions of article 31 (2),\nand, as laws falling under article 31 ( 4) or under\narticles 31-A and 31-B cannot be called in question\nin a court of law for non-compliance with those pre>-\nvisions, such laws cannot be struck down as uncon-\nstitutional and void.\n;\nIt was further contended that the power to make a\nlaw under entry 42 of List III was a power coupled\nwith a duty, because such law was obviously intended\nS.C.R. SUPREME COURT REPORTS 907\nfor the benefit of the expropriated owners, and where 1952\nthe Legislature has authorised such expropriation, it\nThe State of\nwas also bound to exercise the power of making a law\nBihar\nlaying down the principles on which such owners\nv.\nshould be compensated for their loss.",
  "time_taken_sec": 161.17249178886414,
  "memory_usage_mb": 4971.98828125
},
{
  "_id": {
    "$oid": "671b3bc9c30d45f248c0f823"
  },
  "file_name": "pdf4.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf4.pdf",
  "file_size": 1324200,
  "title": "jftLVªh lañ Mhñ REGISTERED NO. सी.जी.-डीx.एxलx.G-अI.D-2H5x12x2x023-250883 CG-DL-E-25122023-250883 xxxGIDExxx vlk/kkj.k EXTRAORDINARY",
  "author": ",u, N, SAKA, LegislativeDepartment, Saka, 1, 2",
  "keywords": [
    "person",
    "whoever",
    "1",
    "shall",
    "b",
    "orwithboth",
    "section",
    "2",
    "andshallalsobeliabletofine",
    "explanation"
  ],
  "summary": "A Magistrate exercising jurisdiction in respect of a charge on which he has\npowertosentencetofineorimprisonment,withorwithoutappeal,isaJudge;\n(17)“life” meansthelifeofahumanbeing,unlessthecontraryappearsfromthe\ncontext;\n(18)“locallaw”meansalawapplicableonlytoa particularpartofIndia;\n(19)“man”meansmalehumanbeingofanyage;\n(20)“month”and“year”.––Wherevertheword“month”ortheword“year”is\nused,itistobeunderstoodthatthemonthortheyearistobereckonedaccordingto\ntheGregoriancalendar;\n(21) “movable property” includes property of every description, except land\nandthingsattachedtotheearthorpermanentlyfastenedtoanythingwhichisattached\ntotheearth;\n(22)“number”.—Unlessthecontraryappearsfromthecontext,wordsimporting\nthesingularnumberincludethepluralnumber,andwordsimportingthepluralnumber\nincludethesingularnumber;\n(23)“oath”includesasolemnaffirmationsubstitutedbylawforanoath,and\nanydeclarationrequiredorauthorisedbylawtobemadebeforeapublicservantorto\nbeusedforthepurposeofproof,whetherinaCourtornot;\n(24) “offence”.—Except in the Chapters and sections mentioned in\nsub-clauses(a)and(b),theword“offence”meansathingmadepunishablebythis\nSanhita, but––\n(a)inChapterIIIandinthefollowingsections,namely,sub-sections(2),\n(3),(4)and(5)ofsection8,sections9,49,50,52,54,55,56,57,58,59,60,61,119,\n120,123,sub-sections(7)and(8)ofsection127,222,230,231, 240,248,250,\n251, 259, 260, 261, 262, 263, sub-sections (6) and (7) of section 308 and\nsub-section(2)ofsection330,theword“offence”meansathingpunishable\nunderthisSanhita,orunderanyspeciallaworlocallaw;and\n(b)insub-section(1)ofsection189,sections211,212,238,239,249,253\nand sub-section (1) of section 329, the word “offence” shall have the same\nmeaningwhentheactpunishableunderthespeciallaworlocallawispunishable\nundersuchlawwithimprisonmentforatermofsixmonthsormore,whether\nwithorwithoutfine;\n(25)“omission”denotesaswellasaseriesofomissionsasasingleomission;\n(26)“person”includesanycompanyorassociationorbodyofpersons,whether\nincorporatedornot;\n(27)“public”includesanyclassofthepublicoranycommunity;\n(28) “public servant” means a person falling under any of the descriptions,\nnamely:—\n(a)everycommissionedofficerintheArmy,NavyorAirForce;\n(b) every Judge including any person empowered by law to discharge,\nwhetherbyhimselforasamemberofanybodyofpersons,anyadjudicatory\nfunctions;\n(c)everyofficerofaCourtincludingaliquidator,receiverorcommissioner\nwhosedutyitis,assuchofficer,toinvestigateorreportonanymatteroflawor\nfact,ortomake,authenticate,orkeepanydocument,ortotakechargeordispose\nSec.1] THEGAZETTEOFINDIAEXTRAORDINARY 5\n_____________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\nofanyproperty,ortoexecuteanyjudicialprocess,ortoadministeranyoath,or\nto interpret, or to preserve order in the Court, and every person specially\nauthorisedbyaCourttoperformanyofsuchduties;\n(d)everyassessorormemberofapanchayatassistingaCourtorpublic\nservant;\n(e)everyarbitratororotherpersontowhomanycauseormatterhasbeen\nreferredfordecisionorreportbyanyCourt,orbyanyothercompetentpublic\nauthority;\n(f)everypersonwhoholdsanyofficebyvirtueofwhichheisempowered\ntoplaceorkeepanypersoninconfinement;\n(g)everyofficeroftheGovernmentwhosedutyitis,assuchofficer,to\npreventoffences,togiveinformationofoffences,tobringoffenderstojustice,\nortoprotectthepublichealth,safetyorconvenience;\n(h)everyofficerwhosedutyitis,assuchofficer,totake,receive,keepor\nexpend any property on behalf of the Government, or to make any survey,\nassessment or contract on behalf of the Government, or to execute any\nrevenue-process, or to investigate, or to report, on any matter affecting the\npecuniary interests of the Government, or to make, authenticate or keep any\ndocumentrelatingtothepecuniaryinterestsoftheGovernment,ortoprevent\nthe infraction of any law for the protection of the pecuniary interests of the\nGovernment;\n(i)everyofficerwhosedutyitis,assuchofficer,totake,receive,keepor\nexpendanyproperty,tomakeanysurveyorassessmentortolevyanyrateortax\nfor any secular common purpose of any village, town or district, or to make,\nauthenticate or keep any document for the ascertaining of the rights of the\npeopleofanyvillage,townordistrict;\n(j)everypersonwhoholdsanyofficebyvirtueofwhichheisempowered\ntoprepare,publish,maintainorreviseanelectoralrollortoconductanelection\norpartofanelection;\n(k)everyperson—\n(i)intheserviceorpayoftheGovernmentorremuneratedbyfeesor\ncommissionfortheperformanceofanypublicdutybytheGovernment;\n(ii)intheserviceorpayofalocalauthorityasdefinedinclause(31)\n10 of 1897. 326.Whoevercommitsmischief by,— Mischief by\ninjury,\n(a) doing any act which causes, or which he knows to be likely to cause, a inundation, fire\ndiminutionofthesupplyofwaterforagriculturalpurposes,orforfoodordrinkfor or explosive\nsubstance, etc.\nhumanbeingsorforanimalswhichareproperty,orforcleanlinessorforcarryingon\nanymanufacture,shallbepunishedwithimprisonmentofeitherdescriptionforaterm\nwhichmayextendtofiveyears,orwithfine,orwithboth;\n(b)doinganyactwhichrendersorwhichheknowstobelikelytorenderany\npublicroad,bridge,navigableriverornavigablechannel,naturalorartificial,impassable\norlesssafefortravellingorconveyingproperty,shallbepunishedwithimprisonment\nofeitherdescriptionforatermwhichmayextendtofiveyears,orwithfine,orwith\nboth;\n(c) doing any act which causes or which he knows to be likely to cause an\ninundationoranobstructiontoanypublicdrainageattendedwithinjuryordamage,\nshallbepunishedwithimprisonmentofeitherdescriptionforatermwhichmayextend\ntofiveyears,orwithfine,orwithboth;\n(d) destroyingormovinganysignorsignalusedfornavigationofrail,aircraft\norshiporotherthingplacedasaguidefornavigators,orbyanyactwhichrendersany\nsuch sign or signal less useful as a guide for navigators, shall be punished with\nimprisonmentofeitherdescriptionforatermwhichmayextendtosevenyears,orwith\nfine,orwithboth;\n(e) destroyingormovinganyland-markfixedbytheauthorityofapublicservant,\norbyanyactwhichrenderssuchland-marklessusefulassuch,shallbepunishedwith\nimprisonmentofeitherdescriptionforatermwhichmayextendtooneyear,orwith\nfine,orwithboth;\n(f) fireoranyexplosivesubstanceintendingtocause,orknowingittobelikely\nthat he will thereby cause, damage to any property including agricultural produce,\nshallbepunishedwithimprisonmentofeitherdescriptionforatermwhichmayextend\ntosevenyears,andshallalsobeliabletofine;\n(g) fireoranyexplosivesubstance,intendingtocause,orknowingittobelikely\nthathewilltherebycause,thedestructionofanybuildingwhichisordinarilyusedas\naplaceofworshiporasahumandwellingorasaplaceforthecustodyofproperty,\nshallbepunishedwithimprisonmentforlife,orwithimprisonmentofeitherdescription\nforatermwhichmayextendtotenyears,andshallalsobeliabletofine.\n",
  "time_taken_sec": 150.1397488117218,
  "memory_usage_mb": 5544.71484375
},
{
  "_id": {
    "$oid": "671b3be1c30d45f248c0f824"
  },
  "file_name": "pdf3.pdf",
  "file_path": "C:\\Users\\honey\\Documents\\Data Science\\Wasserstoff\\PDFs\\pdf3.pdf",
  "file_size": 2413611,
  "title": "£ÉÉ®iÉ BÉEÉ ºÉÆÉÊ´ÉvÉÉxÉ [1 , 2024 ] THE CONSTITUTION OF",
  "author": "Unknown Author",
  "keywords": [
    "shall",
    "1",
    "act",
    "state",
    "constitution",
    "2",
    "may",
    "e",
    "india",
    "amendment"
  ],
  "summary": "243 THE CONSTITUTION OF INDIA\n(Part XXI.—Temporary, Transitional and Special Provisions)\n(i) the High Court functioning as such immediately before the\nappointed day in the territories comprised in the State of Sikkim shall, on\nand from the appointed day, be deemed to be the High Court for the\nState of Sikkim;\n(j) all courts of civil, criminal and revenue jurisdiction, all authorities and\nall officers, judicial, executive and ministerial, throughout the territory of the\nState of Sikkim shall continue on and from the appointed day to exercise\ntheir respective functions subject to the provisions of this Constitution;\n(k) all laws in force immediately before the appointed day in the\nterritories comprised in the State of Sikkim or any part thereof shall\ncontinue to be in force therein until amended or repealed by a competent\nLegislature or other competent authority;\n(l) for the purpose of facilitating the application of any such law as is\nreferred to in clause (k) in relation to the administration of the State of\nSikkim and for the purpose of bringing the provisions of any such law\ninto accord with the provisions of this Constitution, the President may,\nwithin two years from the appointed day, by order, make such\nadaptations and modifications of the law, whether by way of repeal or\namendment, as may be necessary or expedient, and thereupon, every\nsuch law shall have effect subject to the adaptations and modifications so\nmade, and any such adaptation or modification shall not be questioned in\nany court of law;\n(m) neither the Supreme Court nor any other court shall have\njurisdiction in respect of any dispute or other matter arising out of any\ntreaty, agreement, engagement or other similar instrument relating to\nSikkim which was entered into or executed before the appointed day and\nto which the Government of India or any of its predecessor Governments\nwas a party, but nothing in this clause shall be construed to derogate\nfrom the provisions of article 143;\n(n) the President may, by public notification, extend with such restrictions\nor modifications as he thinks fit to the State of Sikkim any enactment which\nis in force in a State in India at the date of the notification;\n(o) if any difficulty arises in giving effect to any of the foregoing\nprovisions of this article, the President may, by order, do anything\n(including any adaptation or modification of any other article) which\nappears to him to be necessary for the purpose of removing that\ndifficulty:\n______________________________________________\nSee the Constitution (Removal of Difficulties) 366. Definitions.—In this Constitution, unless the context otherwise\nrequires, the following expressions have the meanings hereby respectively\nassigned to them, that is to say—\n(1) “agricultural income” means agricultural income as defined\nfor the purposes of the enactments relating to Indian income-tax;\n223 THE CONSTITUTION OF INDIA\n(Part XIX.—MISCELLANEOUS)\n(2) “an Anglo-Indian” means a person whose father or any of\nwhose other male progenitors in the male line is or was of European\ndescent but who is domiciled within the territory of India and is or was\nborn within such territory of parents habitually resident therein and not\nestablished there for temporary purposes only;\n(3) “article” means an article of this Constitution;\n(4) “borrow” includes the raising of money by the grant of\nannuities, and “loan” shall be construed accordingly;\n1[(4A)* * * *]\n(5) “clause” means a clause of the article in which the expression\noccurs;\n(6) “corporation tax” means any tax on income, so far as that tax\nis payable by companies and is a tax in the case of which the following\nconditions are fulfilled:—\n(a) that it is not chargeable in respect of agricultural\nincome;\n(b) that no deduction in respect of the tax paid by\ncompanies is, by any enactments which may apply to the tax,\nauthorised to be made from dividends payable by the companies\nto individuals;\n(c) that no provision exists for taking the tax so paid into\naccount in computing for the purposes of Indian income-tax the\ntotal income of individuals receiving such dividends, or in\ncomputing the Indian income-tax payable by, or refundable to,\nsuch individuals;\n(7) “corresponding Province”, “corresponding Indian State” or\n“corresponding State” means in cases of doubt such Province, Indian\nState or State as may be determined by the President to be the\ncorresponding Province, the corresponding Indian State or the\ncorresponding State, as the case may be, for the particular purpose in\nquestion;\n______________________________________________\n",
  "time_taken_sec": 181.18166995048523,
  "memory_usage_mb": 3764.26953125
}]